app/controllers/feeds_controller.rb

INSERT INTO "feeds" ("LastUpdate", "created_at", "description", "link", "title", "updated_at") VALUES ('2010-11-28 05:45:52.000000', '2010-11-28 05:45:52.052492', 'Visit to Wow! eBook to download ebook, premium wordpress themes, seo tips, make money tutorials and much more...', 'http://www.wowebook.com/feed', 'Wow! eBook - Great ebook, great site!', '2010-11-28 05:45:52.052492')
---
  def create
    @feed = current_user.feeds.build(params[:feed])

    begin
	link = processRssLink(@feed[:link])
	rss = parse(link)
    rescue
	flash[:error]='The url is not a valid feed link'
	redirect_to(:action=>'new')
	return
    end

    @feed.link= link
    @feed.title= rss.channel.title
    @feed.description= rss.channel.description
    @feed.LastUpdate= rss.items.last.date.to_s

    if @feed.save

SELECT "feeds".* FROM "feeds" WHERE ("feeds"."id" = 3) LIMIT 1
---
  def show
    @feed = Feed.find(params[:id])

SELECT "feeds".* FROM "feeds" WHERE ("feeds"."id" = 3) LIMIT 1
---
  def edit
    @feed = Feed.find(params[:id])

SELECT "feeds".* FROM "feeds" WHERE ("feeds"."id" = 1) LIMIT 1
DELETE FROM "feeds" WHERE ("feeds"."id" = 1)
---
  def destroy
    @feed = Feed.find(params[:id])
    @feed.destroy

SELECT "feeds".* FROM "feeds" WHERE ("feeds"."id" = 3) LIMIT 1
UPDATE "feeds" SET "link" = 'http://www.google.ca', "updated_at" = '2010-11-24 21:57:50.973210' WHERE ("feeds"."id" = 3)
---
  def update
    @feed = Feed.find(params[:id])
    @feed.update_attributes(params[:feed])