app/controllers/publish_controller.rb

  def index
	@entities = []
	feeds = Feed.find(:all)
	feeds.each { |feed|
---
SELECT "feeds".* FROM "feeds"

  def create
     @entities = []
	feeds = Feed.find(:all)
	feeds.each { |feed|
---
SELECT "feeds".* FROM "feeds"